---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataFinishDescription
source: html/ceda3a28-6f1d-318a-1f84-22f2535538d2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataFinishDescription Property

"Product Finish Description"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductDataFinishDescription { get; }
```